Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Purity is illuminating due to the [absolute] purity of the perfection of wisdom.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: །ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: Purity is illuminating due to the [absolute] purity of the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is illuminating due to the [absolute] purity of the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: རྣམ་པར་དག་པ་སྣང་བའོ། །ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་།
en: Purity is illuminating due to the [absolute] purity of the meditative stabilities, the dhāraṇī gateways, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་དག་པའི་ཕྱིར།
en: II-III: 160} the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: རྣམ་པར་དག་པ་སྣང་བའོ། །ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་ཉིང་གི་མཚམས་སྦྱོར་བ་མ་མཆིས་པའོ།
en: Blessed Lord! Purity is not having rebirth.” “

source: །ཤྭ་ར་དྭ་ཏིའི་བུས་གསོལ་པ་བཅོམ་ལྡན་འདས་གང་ལ་ཉིང་གི་མཚམས་སྦྱོར་བ་མ་མཆིས་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, due to what not having rebirth is not having rebirth purity?” asked Śāradvatīputra. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཟུགས་ལ་འཐོབ་མེད་ཅིང་ཉིང་གི་མཚམས་སྦྱོར་བ་མེད་པ་ནི་རྣམ་པར་དག་པའོ།
en: Śāradvatīputra,” replied the Blessed One, “due to physical forms not passing away and not having rebirth this is purity.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་འཕོ་བ་མེད་ཅིང་ཉིང་གི་མཚམས་སྦྱོར་བ་མེད་པ་ནི་རྣམ་པར་དག་པའོ།
en: Due to feelings, perceptions, formative predispositions, and consciousness not passing away and not having rebirth this is purity.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཕོ་བ་མེད་ཅིང་ཉིང་གི་མཚམས་སྦྱོར་བར་མེད་པ་ནི་རྣམ་པར་དག་པའོ།
en: Due to [all other phenomena, attributes, and attainments], up to and including all-aspect omniscience, not passing away and not having rebirth this is purity.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི། ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པའོ།
en: Blessed Lord, purity is not having affliction.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ། །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: That is due to absolute purity,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་གང་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པའི་སླད་དུ། ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, due to what not having affliction is purity not having affliction?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །གཟུགས་རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཕྱིར་རྣམ་པར་དག་པ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ།
en: The Blessed One replied, “It is due to the natural luminosity of physical forms that purity is not having affliction.

source: །ཚོར་བ་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཕྱིར་རྣམ་པར་དག་པ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའོ།
en: It is due to the natural luminosity of feelings, perceptions, formative predispositions, and consciousness that purity is not having affliction.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཕྱིར། རྣམ་པར་དག་པ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའོ།
en: It is due to the natural luminosity [of all other phenomena, attributes, and attainments], up to and including all-aspect omniscience, that purity is not having affliction.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་ཐོབ་པར་བགྱི་བ་དང་། མངོན་པར་རྟོགས་པར་བགྱི་བ་མ་མཆིས་པའོ།
en: Blessed Lord, purity is neither attained nor is it manifestly realized.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: Śāradvatīputra, that is due to absolute purity,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གང་ལ་ཐོབ་པར་བགྱི་བ་མ་མཆིས་པ་དང་། མངོན་པར་རྟོགས་པར་བགྱི་བ་མ་མཆིས་པ་རྣམ་པར་དག་པ་ལགས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, pertaining to what is purity neither attained nor manifestly realized?” “

source: གཟུགས་ཐོབ་པར་བྱ་བ་མེད་པ་དང་། མངོན་པར་རྟོགས་པར་བྱ་བ་མེད་པ་ནི་རྣམ་པར་དག་པའོ།
en: Śāradvatīputra,” replied the Blessed One, “purity pertains to physical forms that are neither attained nor manifestly realized.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཐོབ་པར་བྱ་བ་མེད་པ་དང་། མངོན་པར་རྟོགས་པར་བྱ་བ་མེད་པ་ནི་རྣམ་པར་དག་པའོ།
en: Purity pertains to feelings, perceptions, formative predispositions, and consciousness that are neither attained nor manifestly realized.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་བྱ་བ་མེད་པ་དང་། མངོན་པར་རྟོགས་པར་བྱ་བ་མེད་པ་ནི་རྣམ་པར་དག་པའོ།
en: Purity pertains [to all other phenomena, attributes, and attainments], up to and including all-aspect omniscience, that are neither attained nor manifestly realized.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་མངོན་པར་མ་གྲུབ་པའོ།
en: Blessed Lord, purity has not been brought into being.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གང་མངོན་པར་མ་གྲུབ་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, regarding what has purity not been brought into being?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་མངོན་པར་མ་གྲུབ་པ་ནི་རྣམ་པར་དག་པའོ།
en: Śāradvatīputra,” replied the Blessed One, “purity regards the not being brought into being of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མངོན་པར་མ་གྲུབ་པ་ནི་རྣམ་པར་དག་པའོ།
en: Purity regards the not being brought into being of feelings, perceptions, formative predispositions, and consciousness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མངོན་པར་མ་གྲུབ་པ་ནི་རྣམ་པར་དག་པའོ།
en: Purity regards the not being brought into being [of all other phenomena, attributes, and attainments], up to and including all-aspect omniscience.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་འདོད་པའི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས་སོ།
en: Blessed Lord, purity is not subject to rebirth in the realm of desire.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་རྣམ་པར་དག་པ་འདོད་པའི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས།
en: Blessed Lord, how is purity not subject to rebirth in the realm of desire?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདོད་པའི་ཁམས་རང་བཞིན་གྱིས་མི་དམིགས་པའི་ཕྱིར་རྣམ་པར་དག་པ་ནི་སྐྱེ་བ་མ་ཡིན་ནོ།
en: Śāradvatīputra,” replied the Blessed One, “purity is not subject to rebirth because the realm of desire is naturally nonapprehensible.” {

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་གཟུགས་ཀྱི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས་སོ།
en: Ki.II-III: 161} “Blessed Lord, purity is not subject to rebirth in the realm of form.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: Śāradvatīputra, that is due to absolute purity,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་རྣམ་པར་དག་པ་གཟུགས་ཀྱི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས།
en: Blessed Lord, how is purity not subject to rebirth in the realm of form?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་ཁམས་རང་བཞིན་གྱིས་མི་དམིགས་པའི་ཕྱིར། རྣམ་པར་དག་པ་ནི་སྐྱེ་བ་མ་ཡིན་ནོ།
en: Śāradvatīputra,” replied the Blessed One, “purity is not subject to rebirth because the realm of form is naturally nonapprehensible.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་གཟུགས་མེད་པའི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས་སོ།
en: Blessed Lord, purity is not subject to rebirth in the realm of formlessness.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤར་དྭ་ཏིའི་བུ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: Śāradvatīputra, that is due to absolute purity,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་རྣམ་པར་དག་པ་གཟུགས་མེད་པའི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས།
en: Blessed Lord, how is purity not subject to rebirth in the realm of formlessness?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་མེད་པའི་ཁམས་རང་བཞིན་གྱིས་མི་དམིགས་པའི་ཕྱིར། རྣམ་པར་དག་པ་ནི་སྐྱེ་བ་མ་ཡིན་ནོ།
en: Śāradvatīputra,” replied the Blessed One, “purity is not subject to rebirth because the realm of formlessness is naturally nonapprehensible.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་འཚལ་བ་མ་མཆིས་པའོ།
en: Blessed Lord, purity is not cognizant.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: Śāradvatīputra, that is due to absolute purity,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་རྣམ་པར་དག་པ་འཚལ་བ་མ་མཆིས་པ་ལགས།
en: Blessed Lord, how is purity not cognizant?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ལ་སེམས་མེད་པའི་ཕྱིར་རྣམ་པར་དག་པ་ལ་ཤེས་པ་མེད་དོ།
en: Śāradvatīputra,” replied the Blessed One, “purity is not cognizant due to the inanimate nature of phenomena.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པས་གཟུགས་མ་འཚལ་ཏོ།
en: Blessed Lord, purity is not cognizant of physical forms.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ། །།
en: Śāradvatīputra, that is due to absolute purity,” replied the Blessed One. “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་རྣམ་པར་དག་པས་གཟུགས་མ་འཚལ་བ་ལགས།
en: Blessed Lord, how is purity not cognizant of physical forms?” “

source: བཅོམ་ལྡན་འདས་གྱིས་བཀའ་སྩལ་པ། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པར་དག་པས་གཟུགས་མ་ཤེས་སོ།
en: Purity is not cognizant of physical forms owing to the emptiness of intrinsic defining characteristics,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པས་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མ་འཚལ་ཏོ།
en: Blessed Lord, purity is not cognizant of feelings, perceptions, formative predispositions, or consciousness.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ། །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: Śāradvatīputra, that is due to absolute purity,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་རྣམ་པར་དག་པས་ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་འཚལ་བ་ལགས།
en: Blessed Lord, how is purity not cognizant of feelings, perceptions, formative predispositions, or consciousness?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ཤ་ར་དྭ་ཏིའི་བུ་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། རྣམ་པར་དག་པས་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་ཤེས་སོ།
en: Purity is not cognizant of feelings, perceptions, formative predispositions, or consciousness owing to the emptiness of intrinsic defining characteristics,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པས་ཆོས་ཐམས་ཅད་ལ་འཚལ་ཏོ།
en: Blessed Lord, purity is not cognizant of anything.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་རྣམ་པར་དག་པས་ཆོས་ཐམས་ཅད་མ་འཚལ་བ་ལགས།
en: Blessed Lord, how is purity not cognizant of anything?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། རྣམ་པར་དག་པས་ཆོས་ཐམས་ཅད་མི་ཤེས་སོ།
en: Śāradvatīputra,” replied the Blessed One, “purity is not cognizant of anything owing to the emptiness of intrinsic defining characteristics.” “Blessed Lord!

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྨན་པར་མི་བགྱིད། གནོད་པར་མི་བགྱིད་དོ།
en: The perfection of wisdom neither helps nor hinders all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྨན་པར་མི་བགྱིད།
en: Blessed Lord, how does the perfection of wisdom neither help nor hinder all-aspect omniscience?” {

source: གནོད་པར་མི་བགྱིད་པ་ལགས།
en: Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཀྱི་དབྱིངས་འདུག་པ་ཉིད་ཀྱི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཕན་པར་མི་བྱེད། གནོད་པར་མི་བྱེད་དོ།
en: II-III: 162} “Śāradvatīputra,” replied the Blessed One, “the perfection of wisdom neither helps nor hinders all-aspect omniscience owing to the presence of reality’s expanse.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ནི་ཆོས་གང་ཡང་ཡོངས་སུ་ལེན་པ་མ་མཆིས་སོ།
en: Blessed Lord, the purity of the perfection of wisdom does not appropriate anything at all.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ཆོས་གང་ཡང་ཡོངས་སུ་ལེན་པ་མ་མཆིས་པ་ལགས།
en: Blessed Lord, how does the purity of the perfection of wisdom not appropriate anything at all?” “

source: བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཀྱི་དབྱིངས་མི་གཡོ་བའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ཆོས་གང་ཡང་ཡོངས་སུ་ལེན་པ་མེད་དོ།
en: Śāradvatīputra,” replied the Blessed One, “the purity of the perfection of wisdom does not appropriate anything at all because reality’s expanse is unmoving.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ་གཟུགས་རྣམ་པར་དག་པའོ།
en: Then the venerable Subhūti said to the Blessed One, “Blessed Lord, the purity of physical forms is due to the purity of the self.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: Subhūti, that is due to absolute purity,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ན་བདག་རྣམ་པར་དག་པས་གཟུགས་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of physical forms due to the purity of the self?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་ཏེ།
en: Subhūti,” replied the Blessed One, “that is due to absolute purity.

source: བདག་མེད་པའི་ཕྱིར་གཟུགས་མེད་པ་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ།
en: Absolute purity denotes that physical forms are nonexistent, owing to the nonexistence of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། ཚོར་བ་དང་འདུ་ཤེས་དག་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of feelings, perceptions, formative predispositions, and consciousness is due to the purity of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ན་བདག་རྣམ་པར་དག་པས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of feelings, perceptions, formative predispositions, and consciousness due to the purity of the self?” “

source: བདག་མེད་པའི་ཕྱིར་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པ་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ།
en: Absolute purity denotes that feelings, perceptions, formative predispositions, and consciousness are nonexistent, owing to the nonexistence of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the sense fields, the sensory elements, and the links of dependent origination is due to the purity of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ན་བདག་རྣམ་པར་དག་པས། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of the sense fields, the sensory elements, and the links of dependent origination due to the purity of the self?” “

source: བདག་མེད་པའི་ཕྱིར་སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མེད་པ་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ།
en: Absolute purity denotes that the sense fields, the sensory elements, and the links of dependent origination are nonexistent, owing to the nonexistence of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པའོ། །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ།
en: Blessed Lord, the purity of the perfection of generosity is due to the purity of the self.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ་ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the emptiness of internal phenomena is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པའོ།།བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ།
en: Blessed Lord, the purity of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, is due to the purity of the self.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པའོ། །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ།
en: Blessed Lord, the purity of the applications of mindfulness is due to the purity of the self.

source: ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the meditative stabilities and the dhāraṇī gateways is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the powers of the tathāgatas, the fearlessnesses, and the kinds of exact knowledge is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the eighteen distinct qualities of the buddhas is due to the purity of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ན་བདག་རྣམ་པར་དག་པས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་དག་པ་ལགས།
en: II-III: 163} “Blessed Lord, why is the purity of the eighteen distinct qualities of the buddhas [and so forth] due to the purity of the self?” “

source: བདག་མེད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མེད་པ་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ། གསོལ་པ།
en: Absolute purity denotes that the eighteen distinct qualities of the buddhas [and so forth] are nonexistent, owing to the nonexistence of the self.” “

source: བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the fruit of entering the stream to nirvāṇa is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the fruit of being destined for only one more rebirth is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of the fruit of no longer being subject to rebirth is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། དགྲ་བཅོམ་པ་ཉིད་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of arhatship is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། རང་བྱང་ཆུབ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of individual enlightenment is due to the purity of the self.

source: བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། བྱང་ཆུབ་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of enlightenment is due to the purity of the self.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: Subhūti, that is due to absolute purity,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བདག་རྣམ་པར་དག་པས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of the fruit of entering the stream to nirvāṇa due to the purity of the self?

source: ཅིའི་སླད་དུ་བདག་རྣམ་པར་དག་པས། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: Why is the purity of the fruit of being destined for only one more rebirth due to the purity of the self?

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: Why is the purity of the fruit of no longer being subject to rebirth due to the purity of the self?

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་རྣམ་པར་དག་པ་ལགས།
en: Why is the purity of arhatship and individual enlightenment due to the purity of the self?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: That is owing to the emptiness of intrinsic defining characteristics,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of knowledge of the path is due to the purity of the self.

source: །བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པའོ།
en: Blessed Lord, the purity of all-aspect omniscience is due to the purity of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བདག་རྣམ་པར་དག་པས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of knowledge of the path due to the purity of the self?

source: ཅིའི་སླད་དུ་བདག་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་ལགས།
en: Why is the purity of all-aspect omniscience due to the purity of the self?” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གཉིས་སུ་མ་མཆིས་ཤིང་རྣམ་པར་དག་པ་ནི་ཐོབ་པར་བགྱི་བ་མ་ལགས། མངོན་པར་རྟོགས་པར་བགྱི་བ་མ་ལགས་སོ།
en: Blessed Lord, nonduality and purity are neither to be attained nor clearly realized.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་གཉིས་སུ་མ་མཆིས་ཤིང་། རྣམ་པར་དག་པ་ནི་ཐོབ་པར་བགྱི་བ་མ་ལགས། མངོན་པར་རྟོགས་པར་བགྱི་བ་མ་ལགས།
en: Blessed Lord, why are nonduality and purity neither to be attained nor clearly realized?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: That is because there is neither affliction nor purification,” replied the Blessed One. “
